In [61]:
import pandas as pd

In [62]:
df  = pd.read_csv("raw_data.csv")
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

Transforming data
1. apply()
2. map()
3. assign()
4. replace(old, new)
5. rename(colums={old: new})
6. sort_values()
7. sort_index()
8. reset_index()
9. rank()
10. Reorder collums

In [63]:
# apply()
df_2 = df.copy()
df_2["tax"] = df_2["income"].apply(lambda x: "20%" if x >= 50000 else "10%" )
# df_2

In [64]:
# map()
gender_map = {"Male": "M", "Female": "F", "Unknown": "U"}
df_2["gender"] = df_2["gender"].map(gender_map)
df_2

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA      M  55000.0  20%
1    1      John Doe  29.0     USA      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN     USA      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%

In [65]:
# assign()
df_2 = df_2.assign(new_income = df_2["income"] * 2)

In [66]:
df_2

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0     USA      M  55000.0  20%    110000.0
1    1      John Doe  29.0     USA      M  55000.0  20%    110000.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%    124000.0
3    3          Alex   NaN     USA      U  47000.0  10%     94000.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  20%    102000.0
6    6           NaN  45.0   India      F  73000.0  20%    146000.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%    136000.0
8    8    Rachel Lee  29.0     USA      F  62000.0  20%    124000.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     90000.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%    116000.0

In [67]:
# replace (old, new)
df_2["country"] = df_2["country"].replace("USA", "US")
df_2

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0      US      M  55000.0  20%    110000.0
1    1      John Doe  29.0      US      M  55000.0  20%    110000.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%    124000.0
3    3          Alex   NaN      US      U  47000.0  10%     94000.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  20%    102000.0
6    6           NaN  45.0   India      F  73000.0  20%    146000.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%    136000.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%    124000.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     90000.0
10  10   Emily Davis  31.0      US    NaN  58000.0  20%    116000.0

In [68]:
# rename()
# df_2.columns = df_2.columns.str.upper() 

df_2 = df_2.rename(columns={"income": "salary"})
df_2

    id          name   age country gender   salary  tax  new_income
0    1      John Doe  29.0      US      M  55000.0  20%    110000.0
1    1      John Doe  29.0      US      M  55000.0  20%    110000.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%    124000.0
3    3          Alex   NaN      US      U  47000.0  10%     94000.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  20%    102000.0
6    6           NaN  45.0   India      F  73000.0  20%    146000.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%    136000.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%    124000.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     90000.0
10  10   Emily Davis  31.0      US    NaN  58000.0  20%    116000.0

In [69]:
# sort_values()
df_2 = df_2.sort_values("salary")
df_2

    id          name   age country gender   salary  tax  new_income
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     90000.0
3    3          Alex   NaN      US      U  47000.0  10%     94000.0
5    5        Li Wei  27.0   China      M  51000.0  20%    102000.0
1    1      John Doe  29.0      US      M  55000.0  20%    110000.0
0    1      John Doe  29.0      US      M  55000.0  20%    110000.0
10  10   Emily Davis  31.0      US    NaN  58000.0  20%    116000.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%    124000.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%    124000.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%    136000.0
6    6           NaN  45.0   India      F  73000.0  20%    146000.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN

In [70]:
# sort_idx()
# df_2.sort_index()

# reset
# df_2.reset_index()

In [77]:
# rank()
df_2["Ranking"] = df_2["salary"].rank(ascending=False, method="max")
df_2

    id          name   age country gender   salary  tax  new_income  Ranking
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     90000.0     10.0
3    3          Alex   NaN      US      U  47000.0  10%     94000.0      9.0
5    5        Li Wei  27.0   China      M  51000.0  20%    102000.0      8.0
1    1      John Doe  29.0      US      M  55000.0  20%    110000.0      7.0
0    1      John Doe  29.0      US      M  55000.0  20%    110000.0      7.0
10  10   Emily Davis  31.0      US    NaN  58000.0  20%    116000.0      5.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%    124000.0      4.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%    124000.0      4.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%    136000.0      2.0
6    6           NaN  45.0   India      F  73000.0  20%    146000.0      1.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN      NaN